Masmiseim36/nxpSDK/devices/MIMXRT1189/periph/PERI_NETC_PORT.h
#define NETC_PORT_PLANIDCR_LANID_MASK            (0xFU)
#define NETC_PORT_PLANIDCR_LANID_SHIFT           (0U)
/*! LANID - LAN Identifier */
#define NETC_PORT_PLANIDCR_LANID(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PLANIDCR_LANID_SHIFT)) & NETC_PORT_PLANIDCR_LANID_MASK)
/*! @} */

/*! @name PISIDCR - Port ingress stream identification configuration register */
/*! @{ */

#define NETC_PORT_PISIDCR_KCPAIR_MASK            (0x1U)
#define NETC_PORT_PISIDCR_KCPAIR_SHIFT           (0U)
#define NETC_PORT_PISIDCR_KCPAIR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PISIDCR_KCPAIR_SHIFT)) & NETC_PORT_PISIDCR_KCPAIR_MASK)

#define NETC_PORT_PISIDCR_KC0EN_MASK             (0x2U)
#define NETC_PORT_PISIDCR_KC0EN_SHIFT            (1U)
/*! KC0EN - Key Construction 0 Enable */
#define NETC_PORT_PISIDCR_KC0EN(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PISIDCR_KC0EN_SHIFT)) & NETC_PORT_PISIDCR_KC0EN_MASK)

#define NETC_PORT_PISIDCR_KC1EN_MASK             (0x4U)
#define NETC_PORT_PISIDCR_KC1EN_SHIFT            (2U)
/*! KC1EN - Key Construction 1 Enable */
#define NETC_PORT_PISIDCR_KC1EN(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PISIDCR_KC1EN_SHIFT)) & NETC_PORT_PISIDCR_KC1EN_MASK)

#define NETC_PORT_PISIDCR_ISEID_MASK             (0xFFFF0000U)
#define NETC_PORT_PISIDCR_ISEID_SHIFT            (16U)
#define NETC_PORT_PISIDCR_ISEID(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PISIDCR_ISEID_SHIFT)) & NETC_PORT_PISIDCR_ISEID_MASK)
/*! @} */

/*! @name PFMCR - Port frame modification configuration register */
/*! @{ */

#define NETC_PORT_PFMCR_FMMA_MASK                (0x1U)
#define NETC_PORT_PFMCR_FMMA_SHIFT               (0U)
/*! FMMA - Frame Modification Misconfiguration Action
 *  0b0..Discard the frame and counted against the port's Tx discard count register (PTXDCR) along with the
 *       setting of the Frame Modification Misconfiguration Discard Reason (FMMDR) flag to 1 in the port's Tx discard
 *       count reason register 0 (PTXDCRR0).
 *  0b1..Transmit the frame without performing any of the ingress and egress frame modification actions specified.
 */
#define NETC_PORT_PFMCR_FMMA(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PFMCR_FMMA_SHIFT)) & NETC_PORT_PFMCR_FMMA_MASK)
/*! @} */

/*! @name PIPV2QMR0 - Port IPV to queue mapping register 0 */
/*! @{ */

#define NETC_PORT_PIPV2QMR0_IPV0_Q_MASK          (0xFU)
#define NETC_PORT_PIPV2QMR0_IPV0_Q_SHIFT         (0U)
#define NETC_PORT_PIPV2QMR0_IPV0_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV0_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV0_Q_MASK)

#define NETC_PORT_PIPV2QMR0_IPV1_Q_MASK          (0xF0U)
#define NETC_PORT_PIPV2QMR0_IPV1_Q_SHIFT         (4U)
#define NETC_PORT_PIPV2QMR0_IPV1_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV1_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV1_Q_MASK)

#define NETC_PORT_PIPV2QMR0_IPV2_Q_MASK          (0xF00U)
#define NETC_PORT_PIPV2QMR0_IPV2_Q_SHIFT         (8U)
#define NETC_PORT_PIPV2QMR0_IPV2_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV2_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV2_Q_MASK)

#define NETC_PORT_PIPV2QMR0_IPV3_Q_MASK          (0xF000U)
#define NETC_PORT_PIPV2QMR0_IPV3_Q_SHIFT         (12U)
#define NETC_PORT_PIPV2QMR0_IPV3_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV3_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV3_Q_MASK)

#define NETC_PORT_PIPV2QMR0_IPV4_Q_MASK          (0xF0000U)
#define NETC_PORT_PIPV2QMR0_IPV4_Q_SHIFT         (16U)
#define NETC_PORT_PIPV2QMR0_IPV4_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV4_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV4_Q_MASK)

#define NETC_PORT_PIPV2QMR0_IPV5_Q_MASK          (0xF00000U)
#define NETC_PORT_PIPV2QMR0_IPV5_Q_SHIFT         (20U)
#define NETC_PORT_PIPV2QMR0_IPV5_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV5_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV5_Q_MASK)

#define NETC_PORT_PIPV2QMR0_IPV6_Q_MASK          (0xF000000U)
#define NETC_PORT_PIPV2QMR0_IPV6_Q_SHIFT         (24U)
#define NETC_PORT_PIPV2QMR0_IPV6_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV6_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV6_Q_MASK)

#define NETC_PORT_PIPV2QMR0_IPV7_Q_MASK          (0xF0000000U)
#define NETC_PORT_PIPV2QMR0_IPV7_Q_SHIFT         (28U)
#define NETC_PORT_PIPV2QMR0_IPV7_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV7_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV7_Q_MASK)
/*! @} */

/*! @name PTCMINLR - Port time capture minimum latency register */
/*! @{ */

#define NETC_PORT_PTCMINLR_LATENCY_MASK          (0x3FFFFFFFU)
#define NETC_PORT_PTCMINLR_LATENCY_SHIFT         (0U)
#define NETC_PORT_PTCMINLR_LATENCY(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTCMINLR_LATENCY_SHIFT)) & NETC_PORT_PTCMINLR_LATENCY_MASK)

#define NETC_PORT_PTCMINLR_COUNT_MASK            (0xC0000000U)
#define NETC_PORT_PTCMINLR_COUNT_SHIFT           (30U)
#define NETC_PORT_PTCMINLR_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTCMINLR_COUNT_SHIFT)) & NETC_PORT_PTCMINLR_COUNT_MASK)
/*! @} */

/*! @name PTCMAXLR - Port time capture maximum latency register */
/*! @{ */

#define NETC_PORT_PTCMAXLR_LATENCY_MASK          (0x3FFFFFFFU)
#define NETC_PORT_PTCMAXLR_LATENCY_SHIFT         (0U)
#define NETC_PORT_PTCMAXLR_LATENCY(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTCMAXLR_LATENCY_SHIFT)) & NETC_PORT_PTCMAXLR_LATENCY_MASK)
/*! @} */

/*! @name BPCR - Bridge port configuration register */
/*! @{ */

#define NETC_PORT_BPCR_DYN_LIMIT_MASK            (0xFFFFU)
#define NETC_PORT_BPCR_DYN_LIMIT_SHIFT           (0U)
/*! DYN_LIMIT - Dynamic Limit */
#define NETC_PORT_BPCR_DYN_LIMIT(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPCR_DYN_LIMIT_SHIFT)) & NETC_PORT_BPCR_DYN_LIMIT_MASK)

#define NETC_PORT_BPCR_UUCASTE_MASK              (0x1000000U)
#define NETC_PORT_BPCR_UUCASTE_SHIFT             (24U)
/*! UUCASTE - Unknown Unicast Storm Control Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_PORT_BPCR_UUCASTE(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPCR_UUCASTE_SHIFT)) & NETC_PORT_BPCR_UUCASTE_MASK)

#define NETC_PORT_BPCR_UMCASTE_MASK              (0x2000000U)
#define NETC_PORT_BPCR_UMCASTE_SHIFT             (25U)
/*! UMCASTE - Unknown Multicast Storm Control Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_PORT_BPCR_UMCASTE(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPCR_UMCASTE_SHIFT)) & NETC_PORT_BPCR_UMCASTE_MASK)

