Masmiseim36/nxpSDK/devices/MIMXRT1189/periph/PERI_NETC_PORT.h
#define NETC_PORT_BPCR_MCASTE_MASK               (0x4000000U)
#define NETC_PORT_BPCR_MCASTE_SHIFT              (26U)
/*! MCASTE - Multicast Storm Control Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_PORT_BPCR_MCASTE(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPCR_MCASTE_SHIFT)) & NETC_PORT_BPCR_MCASTE_MASK)

#define NETC_PORT_BPCR_BCASTE_MASK               (0x8000000U)
#define NETC_PORT_BPCR_BCASTE_SHIFT              (27U)
/*! BCASTE - Broadcast Storm Control Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_PORT_BPCR_BCASTE(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPCR_BCASTE_SHIFT)) & NETC_PORT_BPCR_BCASTE_MASK)

#define NETC_PORT_BPCR_STAMVD_MASK               (0x10000000U)
#define NETC_PORT_BPCR_STAMVD_SHIFT              (28U)
/*! STAMVD - Station Move Disallow
 *  0b0..Allowed
 *  0b1..Disallowed. A received frame for which a MAC station move is detected, will be discarded.
 */
#define NETC_PORT_BPCR_STAMVD(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPCR_STAMVD_SHIFT)) & NETC_PORT_BPCR_STAMVD_MASK)

#define NETC_PORT_BPCR_SRCPRND_MASK              (0x20000000U)
#define NETC_PORT_BPCR_SRCPRND_SHIFT             (29U)
/*! SRCPRND - Source Port Pruning Disable
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define NETC_PORT_BPCR_SRCPRND(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPCR_SRCPRND_SHIFT)) & NETC_PORT_BPCR_SRCPRND_MASK)
/*! @} */

/*! @name BPDVR - Bridge port default VLAN register */
/*! @{ */

#define NETC_PORT_BPDVR_VID_MASK                 (0xFFFU)
#define NETC_PORT_BPDVR_VID_SHIFT                (0U)
#define NETC_PORT_BPDVR_VID(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDVR_VID_SHIFT)) & NETC_PORT_BPDVR_VID_MASK)

#define NETC_PORT_BPDVR_DEI_MASK                 (0x1000U)
#define NETC_PORT_BPDVR_DEI_SHIFT                (12U)
#define NETC_PORT_BPDVR_DEI(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDVR_DEI_SHIFT)) & NETC_PORT_BPDVR_DEI_MASK)

#define NETC_PORT_BPDVR_PCP_MASK                 (0xE000U)
#define NETC_PORT_BPDVR_PCP_SHIFT                (13U)
#define NETC_PORT_BPDVR_PCP(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDVR_PCP_SHIFT)) & NETC_PORT_BPDVR_PCP_MASK)

#define NETC_PORT_BPDVR_TPID_MASK                (0x10000U)
#define NETC_PORT_BPDVR_TPID_SHIFT               (16U)
#define NETC_PORT_BPDVR_TPID(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDVR_TPID_SHIFT)) & NETC_PORT_BPDVR_TPID_MASK)

#define NETC_PORT_BPDVR_RXTAGA_MASK              (0xF00000U)
#define NETC_PORT_BPDVR_RXTAGA_SHIFT             (20U)
#define NETC_PORT_BPDVR_RXTAGA(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDVR_RXTAGA_SHIFT)) & NETC_PORT_BPDVR_RXTAGA_MASK)

#define NETC_PORT_BPDVR_RXVAM_MASK               (0x1000000U)
#define NETC_PORT_BPDVR_RXVAM_SHIFT              (24U)
#define NETC_PORT_BPDVR_RXVAM(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDVR_RXVAM_SHIFT)) & NETC_PORT_BPDVR_RXVAM_MASK)

#define NETC_PORT_BPDVR_TXTAGA_MASK              (0x6000000U)
#define NETC_PORT_BPDVR_TXTAGA_SHIFT             (25U)
#define NETC_PORT_BPDVR_TXTAGA(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDVR_TXTAGA_SHIFT)) & NETC_PORT_BPDVR_TXTAGA_MASK)
/*! @} */

/*! @name BPSTGSR - Bridge port spanning tree group state register */
/*! @{ */

#define NETC_PORT_BPSTGSR_STG_STATE0_MASK        (0x3U)
#define NETC_PORT_BPSTGSR_STG_STATE0_SHIFT       (0U)
#define NETC_PORT_BPSTGSR_STG_STATE0(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE0_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE0_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE1_MASK        (0xCU)
#define NETC_PORT_BPSTGSR_STG_STATE1_SHIFT       (2U)
#define NETC_PORT_BPSTGSR_STG_STATE1(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE1_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE1_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE2_MASK        (0x30U)
#define NETC_PORT_BPSTGSR_STG_STATE2_SHIFT       (4U)
#define NETC_PORT_BPSTGSR_STG_STATE2(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE2_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE2_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE3_MASK        (0xC0U)
#define NETC_PORT_BPSTGSR_STG_STATE3_SHIFT       (6U)
#define NETC_PORT_BPSTGSR_STG_STATE3(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE3_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE3_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE4_MASK        (0x300U)
#define NETC_PORT_BPSTGSR_STG_STATE4_SHIFT       (8U)
#define NETC_PORT_BPSTGSR_STG_STATE4(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE4_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE4_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE5_MASK        (0xC00U)
#define NETC_PORT_BPSTGSR_STG_STATE5_SHIFT       (10U)
#define NETC_PORT_BPSTGSR_STG_STATE5(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE5_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE5_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE6_MASK        (0x3000U)
#define NETC_PORT_BPSTGSR_STG_STATE6_SHIFT       (12U)
#define NETC_PORT_BPSTGSR_STG_STATE6(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE6_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE6_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE7_MASK        (0xC000U)
#define NETC_PORT_BPSTGSR_STG_STATE7_SHIFT       (14U)
#define NETC_PORT_BPSTGSR_STG_STATE7(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE7_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE7_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE8_MASK        (0x30000U)
#define NETC_PORT_BPSTGSR_STG_STATE8_SHIFT       (16U)
#define NETC_PORT_BPSTGSR_STG_STATE8(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE8_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE8_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE9_MASK        (0xC0000U)
#define NETC_PORT_BPSTGSR_STG_STATE9_SHIFT       (18U)
#define NETC_PORT_BPSTGSR_STG_STATE9(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE9_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE9_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE10_MASK       (0x300000U)
#define NETC_PORT_BPSTGSR_STG_STATE10_SHIFT      (20U)
#define NETC_PORT_BPSTGSR_STG_STATE10(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE10_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE10_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE11_MASK       (0xC00000U)
#define NETC_PORT_BPSTGSR_STG_STATE11_SHIFT      (22U)
#define NETC_PORT_BPSTGSR_STG_STATE11(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE11_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE11_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE12_MASK       (0x3000000U)
#define NETC_PORT_BPSTGSR_STG_STATE12_SHIFT      (24U)
#define NETC_PORT_BPSTGSR_STG_STATE12(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE12_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE12_MASK)

