Masmiseim36/nxpSDK/devices/MIMXRT1189/periph/PERI_NETC_PORT.h
#define NETC_PORT_BPMLFSR_BPMLLRFR_MASK          (0x1U)
#define NETC_PORT_BPMLFSR_BPMLLRFR_SHIFT         (0U)
/*! BPMLLRFR - Bridge Port MAC Learn Limit Reached Failure Reason */
#define NETC_PORT_BPMLFSR_BPMLLRFR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPMLFSR_BPMLLRFR_SHIFT)) & NETC_PORT_BPMLFSR_BPMLLRFR_MASK)

#define NETC_PORT_BPMLFSR_FFDBTRFR_MASK          (0x2U)
#define NETC_PORT_BPMLFSR_FFDBTRFR_SHIFT         (1U)
/*! FFDBTRFR - Full FDB Table Reached Failure Reason */
#define NETC_PORT_BPMLFSR_FFDBTRFR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPMLFSR_FFDBTRFR_SHIFT)) & NETC_PORT_BPMLFSR_FFDBTRFR_MASK)

#define NETC_PORT_BPMLFSR_HCCLRFR_MASK           (0x4U)
#define NETC_PORT_BPMLFSR_HCCLRFR_SHIFT          (2U)
/*! HCCLRFR - Hash Collision chain limit Reached Failure Reason */
#define NETC_PORT_BPMLFSR_HCCLRFR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPMLFSR_HCCLRFR_SHIFT)) & NETC_PORT_BPMLFSR_HCCLRFR_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group NETC_PORT_Register_Masks */


/*!
 * @}
 */ /* end of group NETC_PORT_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_NETC_PORT_H_ */

